Repository: kirinonakar/TxtAIEditor
Catalog: TxtAIEditor/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# AgentMcpCredentialInfo
source: API keys, OAuth secrets and tokens, and stdio environment variables are stored in Windows Credential Manager, not in the MCP settings file.
ja_jp: API Key、OAuth Client Secret、OAuth トークンは MCP 設定ファイルには保存せず、Windows 資格情報マネージャーに保存します。
zh_hans: API 密钥、OAuth 密钥和令牌以及 stdio 环境变量存储在 Windows Credential Manager 中，而不是存储在 MCP 设置文件中。
zh_hant: API 金鑰、OAuth 金鑰和權杖以及 stdio 環境變數會儲存在 Windows Credential Manager，而不是 MCP 設定檔中。

# AgentMcpAuthTypeLabel
source: Authentication
ja_jp: 認証方式
zh_hans: 认证
zh_hant: 認證

# AgentMcpAuthTypeNone
source: None
ja_jp: なし
zh_hans: 无
zh_hant: 無

# AgentMcpAuthTypeApiKey
source: API Key Header
zh_hans: API Key 标头
zh_hant: API Key 標頭

# AgentMcpAuthTypeOAuthBearer
source: OAuth Access Token
zh_hans: OAuth 访问令牌
zh_hant: OAuth 存取令牌

# AgentMcpAuthTypeOAuthBrowser
source: OAuth browser login
ja_jp: OAuth ブラウザーログイン
zh_hans: OAuth浏览器登录
zh_hant: OAuth瀏覽器登入

# AgentMcpOAuthTokenLabel
source: OAuth Access Token
zh_hans: OAuth 访问令牌
zh_hant: OAuth 存取令牌

# AgentMcpOAuthTokenPlaceholder
source: Enter OAuth Access Token...
ja_jp: OAuth Access Token を入力...
zh_hans: Enter OAuth 访问令牌...
zh_hant: Enter OAuth 存取令牌...

# AgentMcpOAuthClientIdLabel
source: OAuth Client ID
zh_hans: OAuth 客户端 ID
zh_hant: OAuth 客戶端 ID

# AgentMcpOAuthClientIdPlaceholder
source: Enter OAuth Client ID...
ja_jp: OAuth Client ID を入力...
zh_hans: Enter OAuth 客户端 ID...
zh_hant: Enter OAuth 客戶端 ID...

# AgentMcpOAuthClientSecretLabel
source: OAuth Client Secret
zh_hans: OAuth 客户端密码
zh_hant: OAuth 客戶端密碼

# AgentMcpOAuthClientSecretPlaceholder
source: Enter OAuth Client Secret...
ja_jp: OAuth Client Secret を入力...
zh_hans: Enter OAuth 客户端秘密...
zh_hant: Enter OAuth 客戶端秘密...

# AgentMcpOAuthAuthorizationEndpointLabel
source: Authorization URL
zh_hans: 授权URL
zh_hant: 授權URL

# AgentMcpOAuthTokenEndpointLabel
source: Token URL
zh_hans: 代币 URL
zh_hant: 代幣 URL

# AgentMcpOAuthScopesLabel
source: OAuth Scope
zh_hans: OAuth 适用范围
zh_hant: OAuth 適用範圍

# AgentMcpOAuthScopesPlaceholder
source: scope1 scope2
zh_hans: 范围1 范围2
zh_hant: 範圍1 範圍2

# AgentMcpSaveAddButton
source: Add
ja_jp: 追加
zh_hans: 添加
zh_hant: 添加

# AgentMcpEditTitle
source: Edit MCP
ja_jp: MCP 編集
zh_hans: 编辑 MCP
zh_hant: 編輯 MCP

# AgentMcpEditSaveButton
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存

# AgentMcpAddErrorTitle
source: Add MCP Error
ja_jp: MCP 追加エラー
zh_hans: 添加 MCP 错误
zh_hant: 新增 MCP 錯誤

# AgentMcpEditErrorTitle
source: Edit MCP Error
ja_jp: MCP 編集エラー
zh_hans: 编辑 MCP 错误
zh_hant: 編輯 MCP 錯誤

# AgentMcpNameEndpointRequired
source: Enter both the MCP name and address.
ja_jp: MCP 名とアドレスを入力してください。
zh_hans: Enter MCP 名称和地址。
zh_hant: Enter MCP 名稱及位址。

# AgentMcpNameRequired
source: Enter the MCP name.
zh_hans: 请输入 MCP 名称。
zh_hant: 請輸入 MCP 名稱。

# AgentMcpCommandRequired
source: Enter the stdio command.
zh_hans: 请输入 stdio 执行命令。
zh_hant: 請輸入 stdio 執行命令。

# AgentMcpArgumentsInvalid
source: stdio arguments must be a JSON array of strings.
zh_hans: stdio 参数必须是字符串组成的 JSON 数组。
zh_hant: stdio 引數必須是由字串組成的 JSON 陣列。

# AgentMcpEnvironmentInvalid
source: Environment variables must be a JSON object with string values.
zh_hans: 环境变量必须是值为字符串的 JSON 对象。
zh_hant: 環境變數必須是值為字串的 JSON 物件。

# AgentMcpEndpointInvalid
source: The MCP address must be an http or https URL.
ja_jp: MCP アドレスは http または https URL である必要があります。
zh_hans: MCP 地址必须是 http 或 https URL。
zh_hant: MCP 位址必須是 http 或 https URL。

# AgentMcpHeaderPairRequired
source: Enter a header name when entering an API Key.
ja_jp: API Key を入力する場合はヘッダー名も入力してください。
zh_hans: Enter 输入 API Key 时的标头名称。
zh_hant: Enter 輸入 API Key 時的標頭名稱。

# AgentMcpOAuthTokenRequired
source: Enter the OAuth Access Token.
ja_jp: OAuth Access Token を入力してください。
zh_hans: Enter OAuth 访问令牌。
zh_hant: Enter OAuth 存取令牌。

# AgentMcpOAuthClientConfigRequired
source: Enter the OAuth Client ID, Client Secret, Authorization URL, and Token URL.
ja_jp: OAuth Client ID、Client Secret、Authorization URL、Token URL を入力してください。
zh_hans: Enter、OAuth 客户端 ID、客户端密钥、授权 URL 和令牌 URL。
zh_hant: Enter、OAuth 客戶端 ID、客戶端金鑰、授權 URL 和令牌 URL。

# AgentMcpOAuthEndpointInvalid
source: The OAuth Authorization URL and Token URL must be http or https URLs.
ja_jp: OAuth Authorization URL と Token URL は http または https URL である必要があります。
zh_hans: OAuth 授权 URL 和令牌 URL 必须是 http 或 https URL。
zh_hant: OAuth 授權 URL 和令牌 URL 必須是 http 或 https URL。

# AgentMcpAuthTypeInvalid
source: This authentication type is not supported.
ja_jp: この認証方式はサポートされていません。
zh_hans: 不支持此身份验证类型。
zh_hant: 不支援此身份驗證類型。

# AgentMcpOAuthLoginTimeout
source: OAuth browser login timed out.
ja_jp: OAuth ブラウザーログインがタイムアウトしました。
zh_hans: OAuth 浏览器登录超时。
zh_hant: OAuth 瀏覽器登入逾時。

# AgentMcpOAuthLoginInvalidResponse
source: The OAuth login response is invalid.
ja_jp: OAuth ログイン応答が正しくありません。
zh_hans: OAuth 登录响应无效。
zh_hant: OAuth 登入回應無效。

# AgentMcpExportErrorTitle
source: Export MCP Error
ja_jp: MCP エクスポート エラー
zh_hans: 导出 MCP 错误
zh_hant: 匯出 MCP 錯誤

# AgentMcpExportErrorMessage
source: An error occurred while exporting MCP servers: {0}
ja_jp: MCP 一覧のエクスポート中にエラーが発生しました: {0}
zh_hans: 导出 MCP 服务器时出错：{0}
zh_hant: 匯出 MCP 伺服器時發生錯誤：{0}

# AgentMcpImportInvalidFile
source: This is not an importable MCP JSON file.
ja_jp: インポート可能な MCP JSON ではありません。
zh_hans: 这不是可导入的 MCP JSON 文件。
zh_hant: 這不是可導入的 MCP JSON 檔案。

# AgentMcpImportErrorTitle
source: Import MCP Error
ja_jp: MCP インポート エラー
zh_hans: 导入 MCP 错误
zh_hant: 導入 MCP 錯誤

# AgentMcpImportErrorMessage
source: An error occurred while importing MCP servers: {0}
ja_jp: MCP 一覧のインポート中にエラーが発生しました: {0}
zh_hans: 导入 MCP 服务器时出错：{0}
zh_hant: 匯入 MCP 伺服器時發生錯誤：{0}

# AgentMcpStatusConnecting
source: Connecting
ja_jp: 接続中
zh_hans: 正在连接
zh_hant: 正在連接

# AgentMcpStatusToolCount
source: {0:N0} tools
ja_jp: {0:N0} 個のツール
zh_hans: {0:N0} 工具
zh_hant: {0:N0} 工具

# AgentMcpStatusFailedFormat
source: Connection failed: {0}
ja_jp: 接続失敗: {0}
zh_hans: 连接失败：{0}
zh_hant: 連線失敗：{0}

# AgentMcpComfyUiDetail
source: Built-in plugin - generate images from API JSON/parameters
ja_jp: 組み込みプラグイン - API JSON/パラメーターから画像生成
zh_hans: 内置插件 - 从 API JSON/parameters 生成图像
zh_hant: 內建外掛 - 從 API JSON/parameters 產生圖像

# AgentMcpBrowserUseDetail
source: Built-in plugin - control the Windows default browser and use Computer Use
ja_jp: 組み込みプラグイン - Windows の既定ブラウザーを操作
zh_hans: 内置插件 - 控制 Windows 默认浏览器及 Computer Use
zh_hant: 內建外掛 - 控制 Windows 預設瀏覽器及 Computer Use

# AgentMcpBrowserUseSettingsTitle
source: Browser Use & Computer Use Settings
ja_jp: Browser Use 設定
zh_hans: Browser Use & Computer Use 设置
zh_hant: Browser Use & Computer Use 設定

# AgentMcpBrowserUseAllowInteractionLabel
source: Allow clicks, keyboard input, and scrolling
ja_jp: クリック、キー入力、スクロールを許可
zh_hans: 允许点击、键盘输入和滚动
zh_hant: 允許點擊、鍵盤輸入與捲動

# AgentMcpBrowserUseCaptureEnabledLabel
source: Use image capture
ja_jp: 画像キャプチャを使用
zh_hans: 使用图像捕获
zh_hant: 使用影像擷取

# AgentMcpBrowserUseComputerUseEnabledLabel
source: Computer Use - control other apps
ja_jp: Computer Use - 他のアプリを操作
zh_hans: Computer Use - 控制其他应用
zh_hant: Computer Use - 控制其他應用程式

# AgentMcpBrowserUseComputerUseInfo
source: When Computer Use is enabled, the Agent can select other open application windows or launch a program and control it with the same image capture, click, and keyboard tools.
ja_jp: Computer Use を有効にすると、Agent は開いている別のアプリケーションウィンドウを選択したり、プログラムを起動したりして、同じ画像キャプチャ、クリック、キー入力ツールで操作できます。
zh_hans: 启用 Computer Use 后，Agent 可以选择其他已打开的应用程序窗口或启动程序，并使用相同的图像捕获、点击和键盘工具进行控制。
zh_hant: 啟用 Computer Use 後，Agent 可以選擇其他已開啟的應用程式視窗或啟動程式，並使用相同的影像擷取、點擊和鍵盤工具進行控制。

# AgentMcpBrowserUseSettingsInfo
source: Browser Use & Computer Use launches the Windows default browser or other applications and controls them with keyboard and mouse input. Read-only URL opening, status checks, and page-text reading remain available regardless of this option.
ja_jp: Browser Use は Windows の既定ブラウザーを起動し、キーボードとマウス入力で操作します。この設定に関係なく、URL を開く、状態を確認する、ページテキストを読む操作は利用できます。
zh_hans: Browser Use & Computer Use 会启动 Windows 默认浏览器或其他应用程序，并通过键盘和鼠标输入进行控制。无论此选项如何设置，仍可使用只读的 URL 打开、状态检查和页面文本读取功能。
zh_hant: Browser Use & Computer Use 會啟動 Windows 預設瀏覽器或其他應用程式，並透過鍵盤與滑鼠輸入進行控制。無論此選項如何設定，仍可使用唯讀的 URL 開啟、狀態檢查與頁面文字讀取功能。

# AgentMcpBuiltInLockedTooltip
source: Built-in plugins cannot be edited or deleted.
ja_jp: 組み込みプラグインは編集または削除できません。
zh_hans: 内置插件无法编辑或删除。
zh_hant: 內建插件無法編輯或刪除。

# AgentMcpBuiltInSettingsTooltip
source: Built-in plugin settings
ja_jp: 組み込みプラグイン設定
zh_hans: 内置插件设置
zh_hant: 內建插件設定

# AgentMcpComfyUiSettingsTitle
source: ComfyUI Settings
ja_jp: ComfyUI 設定
zh_hans: ComfyUI 设置
zh_hant: ComfyUI 設定

# AgentMcpComfyUiLaunchPathLabel
source: ComfyUI launch file
ja_jp: ComfyUI 起動ファイル
zh_hans: ComfyUI 启动文件
zh_hant: ComfyUI 啟動檔案

# AgentMcpComfyUiLaunchPathPlaceholder
source: Path to run_nvidia_gpu.bat
ja_jp: run_nvidia_gpu.bat のパス
zh_hans: run_nvidia_gpu.bat 路径
zh_hant: run_nvidia_gpu.bat 路徑

# AgentMcpComfyUiWorkflowDirectoryLabel
source: Workflow (API) folder
ja_jp: ワークフロー(API)フォルダー
zh_hans: 工作流(API)文件夹
zh_hant: 工作流程(API)資料夾

# AgentMcpComfyUiWorkflowDirectoryPlaceholder
source: ComfyUI API workflow folder
ja_jp: ComfyUI API workflow フォルダー
zh_hans: ComfyUI API workflow 文件夹
zh_hant: ComfyUI API workflow 資料夾

# AgentMcpComfyUiBrowseButton
source: Browse
ja_jp: 参照
zh_hans: 浏览
zh_hant: 瀏覽

# AgentMcpComfyUiOpenFolderTooltip
source: Open in Windows Explorer
ja_jp: エクスプローラーで開く
zh_hans: 在资源管理器中打开
zh_hant: 在檔案總管中開啟

# AgentMcpComfyUiSettingsInfo
source: When the ComfyUI plugin is enabled, TxtAIEditor starts the server from the launch file path and provides the Agent with the JSON list from the selected API workflow folder.
ja_jp: ComfyUI プラグインを有効にすると、起動ファイルのパスでサーバーを自動起動し、指定した API ワークフローフォルダーの JSON 一覧を Agent に提供します。
zh_hans: 启用 ComfyUI 插件时，会通过启动文件路径自动启动服务器，并将指定 API 工作流文件夹中的 JSON 列表提供给 Agent。
zh_hant: 啟用 ComfyUI 插件時，會透過啟動檔案路徑自動啟動伺服器，並將指定 API 工作流程資料夾中的 JSON 清單提供給 Agent。

# AgentMcpComfyUiStartStatusRunning
source: Running
ja_jp: 実行中
zh_hans: 运行中
zh_hant: 執行中

# AgentMcpComfyUiStartStatusLaunchPathMissing
source: Launch file path required
ja_jp: 起動ファイルのパスが必要
zh_hans: 需要启动文件路径
zh_hant: 需要啟動檔案路徑

# AgentMcpComfyUiStartStatusLaunchPathNotFound
source: Launch file not found: {0}
ja_jp: 起動ファイルが見つかりません: {0}
zh_hans: 找不到启动文件: {0}
zh_hant: 找不到啟動檔案: {0}

# AgentMcpComfyUiStartStatusFailedFormat
source: Launch failed: {0}
ja_jp: 起動に失敗しました: {0}
zh_hans: 启动失败: {0}
zh_hant: 啟動失敗: {0}

# AgentMcpComfyUiStartStatusStarting
source: Starting
ja_jp: 起動中
zh_hans: 正在启动
zh_hant: 正在啟動

# AgentMcpComfyUiStartStatusStarted
source: Started
ja_jp: 起動しました
zh_hans: 已启动
zh_hant: 已啟動

# AgentMcpComfyUiWorkflowDirectoryErrorFormat
source: Workflow folder cannot be used: {0}
ja_jp: ワークフローフォルダーを使用できません: {0}
zh_hans: 无法使用工作流文件夹: {0}
zh_hant: 無法使用工作流程資料夾: {0}

# AgentActivityMcpToolFormat
source: Running MCP tool: {0} ({1})
ja_jp: MCP ツール実行中: {0} ({1})
zh_hans: 运行 MCP 工具：{0} ({1})
zh_hant: 運行 MCP 工具：{0} ({1})

# AgentVerboseMcpToolOnly
source: Ran MCP tool
ja_jp: MCP ツールを実行しました
zh_hans: 已执行 MCP 工具
zh_hant: 已執行 MCP 工具

# AgentSelectedChipsScrollLeftTooltip
source: Scroll selected chips left
ja_jp: 選択チップを左へスクロール
zh_hans: 向左滚动选定的筹码
zh_hant: 向左滾動選定的籌碼

# AgentSelectedChipsScrollRightTooltip
source: Scroll selected chips right
ja_jp: 選択チップを右へスクロール
zh_hans: 向右滚动选定的筹码
zh_hant: 向右滾動選定的籌碼

# AgentOpenSessionsTooltip
source: Open sessions
ja_jp: 開いているセッション
zh_hans: 公开会议
zh_hant: 公開會議

# AgentOpenSessionsTitle
source: Open sessions
ja_jp: 開いているセッション
zh_hans: 公开会议
zh_hant: 公開會議

# AgentOpenSessionsEmptyText
source: No open sessions
ja_jp: 開いているセッションはありません
zh_hans: 没有公开会议
zh_hant: 沒有公開會議

# AgentOpenSessionCloseText
source: Close session
ja_jp: セッションを閉じる
zh_hans: 结束会议
zh_hant: 結束會議

# AgentOpenSessionRunningSuffix
source: Running
ja_jp: 実行中
zh_hans: 跑步
zh_hant: 跑步

# AgentCompletedSessionsBadgeTooltip
source: {0:N0} background session(s) completed
ja_jp: 完了したバックグラウンド セッション {0:N0} 件
zh_hans: 已完成 {0:N0} 个后台会话
zh_hant: 已完成 {0:N0} 個背景工作階段

# AgentOpenSessionUntitled
source: New session
ja_jp: 新規セッション
zh_hans: 新会话
zh_hant: 新會話

# SearchReplaceReadOnlyTitle
source: Cannot replace
ja_jp: 置換できません
zh_hans: 无法更换
zh_hant: 無法更換

# SearchReplaceReadOnlyContent
source: Document search results are read-only and cannot be replaced.
ja_jp: ドキュメントファイルの検索結果は内容検索専用のため、置換できません。
zh_hans: 文档搜索结果是只读的且无法替换。
zh_hant: 文件搜尋結果是唯讀的且無法取代。

# DragDropCopyRootCaption
source: Copy to explorer folder
ja_jp: コピー
zh_hans: 复制到资源管理器文件夹
zh_hant: 複製到資源管理器資料夾

# DragDropCopyItemCaptionFormat
source: Copy to '{0}'
ja_jp: '{0}' の場所にコピー
zh_hans: 复制到“{0}”
zh_hant: 複製到“{0}”

# DragDropCopyItemCaption
source: Copy to this location
ja_jp: この場所にコピー
zh_hans: 复制到此位置
zh_hant: 複製到此位置

# DragDropCopyErrorTitle
source: Drag & Drop Copy Error
ja_jp: ドラッグ＆ドロップコピーエラー
zh_hans: 拖放复制错误
zh_hant: 拖放複製錯誤

# CopyOverwriteTitle
source: Confirm Overwrite
ja_jp: 上書きの確認
zh_hans: 确认覆盖
zh_hant: 確認覆蓋

# CopyOverwriteMessage
source: File '{0}' already exists. Do you want to overwrite it?
ja_jp: ファイル '{0}' は既に存在します。上書きしますか？
zh_hans: 文件“{0}”已存在。您想覆盖它吗？
zh_hant: 檔案“{0}”已存在。您想覆蓋它嗎？

# CopyOverwriteFolderMessage
source: Folder '{0}' already exists. Do you want to merge/overwrite it? (Existing files will be kept or overwritten)
ja_jp: フォルダ '{0}' は既に存在します。上書きしますか？ (既存のファイルは維持または上書きされます)
zh_hans: 文件夹“{0}”已存在。您想合并/覆盖它吗？ （现有文件将被保留或覆盖）
zh_hant: 資料夾“{0}”已存在。您想合併/覆蓋它嗎？ （現有文件將被保留或覆蓋）

# CopyOverwriteOK
source: Overwrite
ja_jp: 上書き
zh_hans: 覆盖
zh_hant: 覆蓋

# CopyOverwriteCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# CopyFolderErrorTitle
source: Folder Copy Error
ja_jp: フォルダコピーエラー
zh_hans: 文件夹复制错误
zh_hant: 資料夾複製錯誤

# CopyFolderSelfParent
source: Cannot copy a folder into itself or its own subfolder.
ja_jp: フォルダを自分自身またはそのサブフォルダにコピーすることはできません。
zh_hans: 无法将文件夹复制到其自身或其子文件夹中。
zh_hant: 無法將資料夾複製到其自身或其子資料夾中。

# DragDropOpenFileCaption
source: Open File
ja_jp: ファイルを開く
zh_hans: 打开文件
zh_hant: 開啟文件

# DragDropErrorTitle
source: Drag & Drop Error
ja_jp: ドラッグ＆ドロップエラー
zh_hans: 拖放错误
zh_hant: 拖放錯誤

# AgentAttachFileCaption
source: Attach File
ja_jp: ファイル添付
zh_hans: 附加文件
zh_hant: 附加文件

# SearchFailedTitle
source: Search Failed
ja_jp: 検索失敗
zh_hans: 搜索失败
zh_hant: 搜尋失敗

# SearchNoFolderSelectedMessage
source: Select a folder in Explorer first.
ja_jp: 先にエクスプローラーで作業するフォルダーを選択してください。
zh_hans: 首先在资源管理器中选择一个文件夹。
zh_hant: 首先在資源管理器中選擇一個資料夾。

# SearchInvalidRegexMessageFormat
source: The regular expression is invalid. {0}
ja_jp: 正規表現が正しくありません。 {0}
zh_hans: 正则表达式无效。 {0}
zh_hant: 正規表示式無效。 {0}

# SearchErrorMessageFormat
source: An error occurred while searching. {0}
ja_jp: 検索中にエラーが発生しました。 {0}
zh_hans: 搜索时发生错误。 {0}
zh_hant: 搜尋時發生錯誤。 {0}

# SearchCompletedTitle
source: Search Complete
ja_jp: 検索完了
zh_hans: 搜索完成
zh_hant: 搜尋完成

# SearchNoResultsSkippedFormat
source: No results found. Skipped unreadable files: {0:N0}
ja_jp: 検索結果がありません。 読み取れずスキップしたファイル: {0:N0} 件
zh_hans: 没有找到结果。 跳过不可读的文件：{0:N0}
zh_hant: 沒有找到結果。 跳過不可讀的檔案：{0:N0}

# ReplaceFailedTitle
source: Replace Failed
ja_jp: 置換失敗
zh_hans: 替换失败
zh_hant: 替換失敗

# ReplaceAllWarningTitle
source: Replace All Warning
ja_jp: すべて置換の警告
zh_hans: 替换所有警告
zh_hant: 替換所有警告

# ReplaceAllWarningContentFormat
source: Replace {0:N0} matches with '{1}'?
ja_jp: {0:N0} 件の一致を '{1}' に一括置換しますか？
zh_hans: 将 {0:N0} 匹配项替换为“{1}”？
zh_hant: 將 {0:N0} 匹配項替換為“{1}”？

# ReplaceAllConfirmButton
source: Run Replace
ja_jp: 置換を実行
zh_hans: 运行替换
zh_hant: 運行替換

# ReplaceCompletedTitle
source: Replace Complete
ja_jp: 置換完了
zh_hans: 更换完成
zh_hant: 更換完成

# ReplaceCompletedMessage
source: All matching items have been replaced.
ja_jp: すべての一致項目の置換が完了しました。
zh_hans: 所有匹配的项目都已被替换。
zh_hant: 所有符合的項目都已被替換。

# ReplaceOneFailureFormat
source: Replacement failed: {0}
ja_jp: 置換失敗: {0}
zh_hans: 更换失败：{0}
zh_hant: 更換失敗：{0}

# CompareInvalidSelectionTitle
source: Compare Error
ja_jp: 比較エラー
zh_hans: 比较错误
zh_hant: 比較錯誤

# CompareInvalidSelectionMessage
source: Select two valid files or tabs.
ja_jp: 有効な 2 つのファイルまたはタブを選択してください。
zh_hans: 选择两个有效的文件或选项卡。
zh_hant: 選擇兩個有效的檔案或選項卡。

# OpenInBrowserDialogTitle
source: Open in Browser
ja_jp: ブラウザーで開く
zh_hans: 在浏览器中打开
zh_hant: 在瀏覽器中開啟

# OpenInBrowserFailedTitle
source: Open in Browser Failed
ja_jp: ブラウザーで開けません
zh_hans: 在浏览器中打开失败
zh_hant: 在瀏覽器中開啟失敗

# OpenInBrowserNoActiveTab
source: No active tab is available to open in the browser.
ja_jp: ブラウザーで開くアクティブなタブがありません。
zh_hans: 浏览器中没有可打开的活动选项卡。
zh_hant: 瀏覽器中沒有可開啟的活動標籤。

# CharacterMapOpenFailedTitle
source: Character Map Launch Failed
ja_jp: 文字コード表の起動失敗
zh_hans: 字符映射表启动失败
zh_hant: 字元對映表啟動失敗

# EmojiFileOpenFailedTitle
source: Open Emoji File Failed
ja_jp: 絵文字ファイルを開けません
zh_hans: 打开表情符号文件失败
zh_hant: 開啟表情符號檔失敗

# StartupOpenFailedTitle
source: Startup File Open Failed
ja_jp: 起動時ファイルを開けません
zh_hans: 启动文件打开失败
zh_hant: 啟動文件開啟失敗

# SaveFailedTitle
source: Save Failed
ja_jp: 保存失敗
zh_hans: 保存失败
zh_hant: 保存失敗

# SaveEditorFlushFailed
source: The editor input could not be finalized, so the save was cancelled. Try again.
zh_hans: 无法确认编辑器输入，已取消保存。请重试。
zh_hant: 無法確認編輯器輸入，已取消儲存。請再試一次。

# EncryptedTabMissingPassword
source: The encrypted tab has no password. Reopen the file and enter the password.
ja_jp: 暗号化されたタブのパスワードがありません。ファイルを開き直してパスワードを入力してください。
zh_hans: 加密选项卡没有密码。重新打开文件并输入密码。
zh_hant: 加密選項卡沒有密碼。重新開啟檔案並輸入密碼。

# EncodingChangeFailedTitle
source: Encoding Change Failed
ja_jp: エンコード変更失敗
zh_hans: 编码更改失败
zh_hant: 編碼更改失敗

# SaveDialogTextFileFilter
source: Text File
ja_jp: テキストファイル
zh_hans: 文本文件
zh_hant: 文字檔案

# SaveDialogMarkdownFileFilter
source: Markdown File
ja_jp: Markdown ファイル
zh_hans: Markdown 文件
zh_hant: Markdown 文件

# SaveDialogHtmlFileFilter
source: HTML File
ja_jp: HTML ファイル
zh_hans: HTML 文件
zh_hant: HTML 文件

# SaveDialogLatexFileFilter
source: LaTeX File
ja_jp: LaTeX ファイル
zh_hans: LaTeX 文件
zh_hant: LaTeX 文件

# PreviewCsvEmpty
source: Empty CSV file.
ja_jp: 空の CSV ファイルです。
zh_hans: 空 CSV 文件。
zh_hant: 空 CSV 檔。

# StickyNotePlaceholder
source: Quick note...
ja_jp: すばやくメモ...
zh_hans: 快速注意...
zh_hant: 快速注意...

# StickyNoteCloseButton
source: Close
ja_jp: 閉じる
zh_hans: 关闭
zh_hant: 關閉

# FileLoadErrorTitle
source: File Load Error
ja_jp: ファイル読み込みエラー
zh_hans: 文件加载错误
zh_hant: 文件載入錯誤

# FileOpenFailedTitle
source: Open File Failed
ja_jp: ファイルを開けません
zh_hans: 打开文件失败
zh_hant: 開啟檔案失敗

# RecentFileMissingMessageFormat
source: Recent file does not exist: {0}
ja_jp: 最近使ったファイルが存在しません: {0}
zh_hans: 最近使用的文件不存在: {0}
zh_hant: 最近使用的檔案不存在: {0}

# FolderOpenFailedTitle
source: Open Folder Failed
ja_jp: フォルダーを開くのに失敗しました
zh_hans: 打开文件夹失败
zh_hant: 開啟資料夾失敗

# RecentFolderMissingMessageFormat
source: Recent folder does not exist: {0}
ja_jp: 最近使ったフォルダーが存在しません: {0}
zh_hans: 最近使用的文件夹不存在: {0}
zh_hant: 最近使用的資料夾不存在: {0}

# CompareTabTitleFormat
source: Compare: {0} ↔ {1}
ja_jp: 比較: {0} ↔ {1}
zh_hans: 比较：{0} ↔ {1}
zh_hant: 比較：{0} ↔ {1}

# AgentHistoryToolCompletedFormat
source: [Tool execution]: {0}
ja_jp: [ツール実行]: {0}
zh_hans: [工具执行]: {0}
zh_hant: [工具執行]: {0}

# EditorFindAllProgressFormat
source: Finding: {0} / {1}
zh_hans: 正在查找：{0} / {1}
zh_hant: 正在尋找：{0} / {1}

# EditorReplaceAllProgressFormat
source: Replacing: {0} / {1}
zh_hans: 正在替换：{0} / {1}
zh_hant: 正在取代：{0} / {1}

# EditorSaveProgressFormat
source: Saving: {0} / {1}
zh_hans: 正在保存：{0} / {1}
zh_hant: 正在儲存：{0} / {1}

# EditorUndoProgressFormat
source: Undoing: {0} / {1}
zh_hans: 正在撤销：{0} / {1}
zh_hant: 正在復原：{0} / {1}

# EditorRedoProgressFormat
source: Redoing: {0} / {1}
zh_hans: 正在重做：{0} / {1}
zh_hant: 正在重做：{0} / {1}

# ExplorerTreeModeTooltip
source: Tree mode
zh_hant: 樹狀模式

# AgentContextCompressedNotice
source: Context compression was performed.
zh_hant: 已執行上下文壓縮。

# SettingsLlmTokenUsageHtmlButton
source: View as HTML
zh_hant: 以 HTML 檢視

# SettingsLlmTokenUsageHtmlFailedFormat
source: Could not open the HTML statistics: {0}
zh_hant: 無法開啟 HTML 統計資料：{0}

# TokenReportLocale
source: en-US
zh_hant: zh-TW

# TokenReportStringsJson
source: {"title":"Token Usage Overview","subtitle":"A cumulative dashboard for requests, token consumption, and cache efficiency","periodBadge":"Display period","themeToggle":"Switch theme","darkModeSwitch":"Switch to dark mode","lightModeSwitch":"Switch to light mode","summaryAria":"Key statistics","totalRequests":"Total requests","dailyAverageFormat":"Daily average {0}","totalTokens":"Total tokens","averagePerRequestFormat":"Average per request {0}","cachedTokens":"Cached tokens","cachedTokensNote":"Reused input tokens","cacheRatio":"Cache ratio","cacheGood":"Healthy efficiency · Target 70% or higher","cacheNeedsImprovement":"Improvement recommended · Target 70% or higher","dailyHeading":"Daily usage trend","dailyDescription":"Compare request volume and token consumption by date.","dailyInsightsAria":"Key daily insights","peakRequests":"Most requests","peakTokens":"Most tokens","requestCount":"Requests","dailyRequestsDescription":"All model requests made during each day","countUnit":"requests","tokenUsage":"Token usage","dailyTokensDescription":"Daily consumption combining input and output","millionUnit":"million","inputOutput":"Input and output","inputOutputDescription":"Daily composition of input and output tokens","input":"Input","output":"Output","cacheEfficiency":"Cache efficiency","cacheEfficiencyDescription":"Values of 70% or higher indicate stable reuse","modelHeading":"Usage by model","modelDescription":"Compare request frequency and token concentration by model.","modelInsightsAria":"Key model insights","mostUsedModel":"Most used model","requestShare":"Request share","modelRequests":"Requests by model","modelRequestsDescription":"Top 8 models by request count","modelTokens":"Total tokens by model","modelTokensDescription":"Models using at least 1,000 tokens","modelInputOutput":"Input and output by model","modelInputOutputDescription":"Input and output for the top 10 models by token usage","horizontalAxisNote":"Horizontal axis: million tokens","noDataTitle":"No token statistics to display","noDataDescription":"This report updates automatically after LLM requests are recorded.","footerPeriodFormat":"Display period {0} · Cumulative","footerProduct":"TxtAIEditor token statistics · Static dashboard powered by Chart.js","generatedAtFormat":"Generated: {0}","requestsFormat":"{0} requests","tokensFormat":"{0} tokens"}
zh_hant: {"title":"Token 使用概覽","subtitle":"集中查看請求量、Token 消耗和快取效率的累計儀表板","periodBadge":"顯示期間","themeToggle":"切換主題","darkModeSwitch":"切換至深色模式","lightModeSwitch":"切換至淺色模式","summaryAria":"關鍵統計","totalRequests":"請求總數","dailyAverageFormat":"每日平均 {0}","totalTokens":"Token 總數","averagePerRequestFormat":"每次請求平均 {0}","cachedTokens":"已快取 Token","cachedTokensNote":"重複使用的輸入 Token","cacheRatio":"快取比例","cacheGood":"效率良好 · 目標 70% 以上","cacheNeedsImprovement":"建議改善 · 目標 70% 以上","dailyHeading":"每日使用趨勢","dailyDescription":"依日期比較請求量與 Token 消耗模式。","dailyInsightsAria":"每日關鍵洞察","peakRequests":"請求峰值","peakTokens":"Token 峰值","requestCount":"請求數","dailyRequestsDescription":"每天發生的所有模型請求","countUnit":"次","tokenUsage":"Token 使用量","dailyTokensDescription":"輸入與輸出合計的每日消耗量","millionUnit":"百萬","inputOutput":"輸入與輸出","inputOutputDescription":"輸入與輸出 Token 的每日組成","input":"輸入","output":"輸出","cacheEfficiency":"快取效率","cacheEfficiencyDescription":"70% 以上表示重複使用穩定","modelHeading":"依模型分析使用情況","modelDescription":"比較各模型的請求頻率和 Token 消耗集中度。","modelInsightsAria":"模型關鍵洞察","mostUsedModel":"使用最多的模型","requestShare":"請求占比","modelRequests":"各模型請求數","modelRequestsDescription":"依請求數排名前 8 的模型","modelTokens":"各模型 Token 總數","modelTokensDescription":"使用至少 1,000 Token 的模型","modelInputOutput":"各模型輸入與輸出","modelInputOutputDescription":"Token 使用量前 10 個模型的輸入與輸出組成","horizontalAxisNote":"橫軸：百萬 Token","noDataTitle":"沒有可顯示的 Token 統計","noDataDescription":"記錄 LLM 請求後，此報告會自動更新。","footerPeriodFormat":"顯示期間 {0} · 累計","footerProduct":"TxtAIEditor Token 統計 · 基於 Chart.js 的靜態儀表板","generatedAtFormat":"產生時間：{0}","requestsFormat":"{0} 次","tokensFormat":"{0} Token"}

# AgentMcpArgumentsPlaceholder
source: ["-y", "@modelcontextprotocol/server-memory"]
zh_hans: ["-y", "@modelcontextprotocol/server-filesystem", "D:\\workspace"]

source: CSV Table
ja_jp: CSVテーブル

source: Table
ja_jp: 表

# SettingsLlmApiKey
source: LLM API Key
ja_jp: LLM API キー
